export const shortStatusCreator = (
  //   type,
  //   condition,
  //   tooth,
  //   area,
  //   crownDestruction,
  //   woundSide,
  //   woundArea,
  //   woundType,
  //   woundLength,
  //   woundWidth,
  //   woundDepth,
  //   woundForm,
  //   woundLedges,
  //   woundBleeding,
  //   woundAliens,
  //   perioTeeth,
  //   _changedList = [{ id: 55, name: 55, status: "" }],
  //   woundSurface,
  //   abscessType,
  //   abscessArea,
  //   abscessSide,
  //   abscessTooth,
  //   cystTooth,
  //   cystDiameter,
  //   isTemporaryToothAbove,
  //   cystType,
  //   rootSealed,
  //   retention1,
  //   retention2,
  //   retention3,
  //   retention4,
  //   neoplasmArea,
  //   neoplasmSide,
  //   neoplasmForm,
  //   neoplasmBorders,
  //   neoplasmMovability,
  //   neoplasmPoignancy,
  //   neoplasmConsistance,
  //   neoplasmDiameter,
  //   neoplasmSurface,
  //   neoplasmColor,
  //   neoplasmSurfaceAlter,
  //   neoplasmAboveColor,
  //   fractureLowerArea1,
  //   fractureLowerSide1,
  //   fractureLowerStep1,
  //   fractureLowerBias1,
  //   fractureLowerSubmucous1,
  //   xRay,
  //   continuity,
  //   fractureLowerDirection1
  // ) => {
  //   const xRayType =
  //     xRay === `рентген`
  //       ? `На оглядовй R–графії черепа в прямій та боковій проекціях: `
  //       : `На КТ голови: `;
  //   const fractureBoneArea1 = fractureLowerArea1 === `кутовий` ? `кута` : ``;
  //   const xRayContent = `${xRayType}порушення цілісності кісткової тканини нижньої щелепи у вигляді ${fractureLowerDirection1.slice(
  //     0,
  //     -2
  //   )}ого перелому в ділянці ${fractureBoneArea1} ${fractureLowerSide1} ${fractureLowerBias1} уламків.`;
  //   const fractureBite =
  //     fractureLowerBias1 === `без зміщення`
  //       ? `Прикус не порушений.`
  //       : `Прикус порушений.`;
  //   const fractureEdema1 =
  //     fractureLowerArea1 === "кутовий"
  //       ? `в нижніх відділах привушно – жувальної області ${fractureLowerSide1}`
  //       : "";
  //   const excursion =
  //     fractureLowerArea1 === "суглобового відростка"
  //       ? `відсутня ${fractureLowerSide1}`
  //       : `в повному об'ємі`;
  //   const painArea1 =
  //     fractureLowerArea1 === "кутовий" ? ` кута нижньої щелепи` : "";
  //   const underMucousBleeding = fractureLowerSubmucous1
  //     ? `Визначається підслизовий крововилив в нижніх відділах крилоподібно – щелепної складки ${fractureLowerSide1}.`
  //     : ``;
  //   const fractureLowerJawTemplate = `Обличчя  асиметричне за рахунок припухлості тканин ${fractureEdema1}. На шкірних покривах в цій ділянці відмічається садно, візуально визначаються підшкірні крововиливи. Відкривання рота щадне із-за болі в ділянці ${painArea1} ${fractureLowerSide1}. Болі тут посилюються при змиканні зубів. ${fractureBite} Екскурсія суглобових голівок ${excursion}. При пальпації припухлості визначаються набряклі, болючі м’які тканини ${painArea1} ${fractureLowerSide1}. Безперервність нижнього краю нижньої щелепи на всьому протязі ${continuity}, симптом «сходинки» ${fractureLowerStep1}. Симптом навантаження в області ${painArea1} ${fractureLowerSide1} виражено позитивний. ${underMucousBleeding} ${xRayContent}`;
  //   const neoplasmAbove = neoplasmSurfaceAlter ? `` : `не`;
  //   const colorAlter = neoplasmAboveColor ? `` : `не`;
  //   const neoplasmTemplate = `Наявний новоутвір ${neoplasmArea} ${neoplasmSide}, ${neoplasmForm} форми, ${neoplasmColor} забарвлення, ${neoplasmBorders}, який ${neoplasmAbove} підвищується над поверхнею. При пальпації: ${neoplasmMovability}, ${neoplasmPoignancy}, ${neoplasmConsistance} консистенції. Діаметр приблизно ${neoplasmDiameter} см; ${neoplasmSurface} над ним в кольорі ${colorAlter} змінена.`;
  //   const retentionList = [retention1, retention2, retention3, retention4];
  //   const filteredRetentionList = retentionList.filter((r) => r !== "");
  //   const neighborRetentionList =
  //     filteredRetentionList.length === 1
  //       ? `впирається в корені сусіднього другого моляра`
  //       : `впираються в корені сусідніх других молярів`;
  //   const retUpperJaw = filteredRetentionList.some((r) => r === 18 || r === 28);
  //   const retLowerJaw = filteredRetentionList.some((r) => r === 38 || r === 48);
  //   const retentionJaw =
  //     retUpperJaw && retLowerJaw
  //       ? `верхньої та нижньої щелеп `
  //       : retUpperJaw
  //       ? `верхньої щелепи `
  //       : retUpperJaw
  //       ? `нижньої щелепи `
  //       : `щелепи `;
  //   const retentionTeeth =
  //     filteredRetentionList.length === 1 ? `зуба ` : `зубів `;
  //   const retentionTeeth2 = filteredRetentionList.length === 1 ? `зуб ` : `зуби `;
  //   const retentionTemplate = ` На панорамній  R–графії ${retentionJaw} – горизонтальне положення ${filteredRetentionList.join(
  //     ","
  //   )} ${retentionTeeth}. ${filteredRetentionList.join(
  //     ","
  //   )}  ${retentionTeeth2} ${neighborRetentionList}. `;
  //   const strCystTooth = cystTooth.toString();
  //   const cystSide = Number(strCystTooth[0]) % 4 < 2 ? `праворуч` : `ліворуч`;
  //   const cystJaw =
  //     Number(strCystTooth[0]) % 4 === 1 || Number(strCystTooth[0]) % 4 === 2
  //       ? `верхньої щелепи`
  //       : `нижньої щелепи`;
  //   const aboveToothMod = Number(cystTooth) + 40;
  //   const aboveToothDesc =
  //     cystType === `радикулярна кіста`
  //       ? `${cystTooth} зуб зруйновано карієсом. `
  //       : isTemporaryToothAbove
  //       ? `${aboveToothMod} зуб зруйновано карієсом. `
  //       : ``;
  //   const aboveTooth =
  //     cystType === `радикулярна кіста`
  //       ? `в ділянці ${cystTooth} зуба`
  //       : isTemporaryToothAbove
  //       ? `в ділянці ${aboveToothMod} та сусідніх зубів`
  //       : `в проекції ${cystTooth} та сусідніх зубів`;
  //   const aboveToothApical =
  //     cystType === `радикулярна кіста`
  //       ? `Кінчики коренів ${cystTooth} зуба контактують з утвором. `
  //       : isTemporaryToothAbove
  //       ? `Кінчики коренів ${aboveToothMod} зуба контактують з утвором. `
  //       : ``;
  //   const deformationArea =
  //     Number(strCystTooth[1]) % 10 > 3
  //       ? `щічної ділянки`
  //       : Number(strCystTooth[0]) % 4 === 1 || Number(strCystTooth[0]) % 4 === 1
  //       ? `верхньої губи`
  //       : `нижньої губи`;
  //   const radicularDesc =
  //     cystType === `радикулярна кіста`
  //       ? ` над апексами коренів ${cystTooth} зуба`
  //       : ``;
  //   const folicularDesc =
  //     cystType === `фолікулярна кіста`
  //       ? `Коронка ${cystTooth} зуба в середині кісти`
  //       : ``;
  //   const cystDiameterMod =
  //     cystDiameter !== `` ? `${cystDiameter} см` : `більше 1 см`;
  //   const rootStatus =
  //     rootSealed === `rootSealed`
  //       ? `Канал ${cystTooth} зуба  запломбований на всьому протязі.`
  //       : rootSealed === `rootSealedNot`
  //       ? `Канал ${cystTooth} зуба  не пломбований.`
  //       : ``;
  //   const generalCondition = `загальний стан дитини задовільний. `;
  //   const cystTemplate =
  //     cystType === `апікальна кістогранульома`
  //       ? ` ${generalCondition} Обличчя симетричне. Пальпація по присінку в ділянці ${cystTooth} зуба в проекції верхівки кореня помірно болісна. Симптом Лукомського позитивний. В ${cystTooth} зубі  трепанаційний отвір. Перкусія його помірно болісна. На прицільній внутрішньоротовій R – графії периапікальних тканин ${cystTooth} зуба осередок гомогенного просвітлення кісткової тканини округлої форми з чітким контуром в ділянці апекса ${cystTooth} зуба. Діаметром приблизно ${cystDiameter} см.
  //   ${rootStatus}`
  //       : `${generalCondition} Обличчя  асиметричне за рахунок деформації у вигляді випинання ${deformationArea} ${cystSide}. Шкіра над деформацією звичайного кольору, в складку береться. При пальпації м’які тканини не змінені, безболісні. Кісткова тканина також безболісна. Спостерігається напівсферичне випинання з вестибулярної сторони та по перехідній складці ${aboveTooth}, при пальпації якого, симптом Рунге – Дюпюітрена позитивний. ${aboveToothDesc}На R–графії ${cystJaw}: ${cystSide} – осередок гомогенного просвітлення кісткової тканини майже округлої форми з чітким контуром, діаметром ${cystDiameterMod}${radicularDesc}. ${aboveToothApical}${folicularDesc}`;
  //   const abscessAreaMod =
  //     abscessArea === "в ділянці сонного трикутника"
  //       ? abscessArea
  //       : abscessArea[abscessArea.length - 1] === "и"
  //       ? `${abscessArea}`
  //       : `${abscessArea} ділянки`;
  //   const abscessTemplate =
  //     abscessType === "флегмона"
  //       ? `обличчя різко асиметричне за рахунок поширеної припухлості м'яких тканин ${abscessAreaMod} ${abscessSide}.
  //    Шкіра тут напружена, гіперемійована, у складку не береться. 
  //    У центрі пальпаторно визначається щільний, болючий інфільтрат без ознак флюктуації. `
  //       : abscessType === `фурункул`
  //       ? ` обличчя асиметричне за рахунок деформації внаслідок інфільтрації тканин ${abscessAreaMod} ${abscessSide}. Місцево спостерігається обмежений болючий щільний інфільтрат, шкіра над ним гіперемована, з ціанотичним відтінком, у складку не береться. 
  //   У центрі інфільтрату на місці волосяного фолікула наявний гнійно-некротичний стрижень. `
  //       : `обличчя асиметричне за рахунок деформації внаслідок інфільтрації тканин ${abscessAreaMod} ${abscessSide}.
  //    Шкіра над інфільтратом гіперемійована, лискуча. 
  //    Пальпаторно визначається щільний, болючий, обмежений інфільтрат з ознаками флюктуації. `;
  
  //   const abscessToothTemplate =
  //     abscessTooth !== ""
  //       ? `Коронка ${abscessTooth} зуба зруйнована карієсом, перкусія його  болісна.`
  //       : "";
  //   let changedList = _changedList || [{ id: 55, name: 55, status: "" }];
  //   const woundSurfaceStr =
  //     woundSurface === "слизова оболонка"
  //       ? " зі сторони слизової оболонки"
  //       : "червона облямівка"
  //       ? woundSurface === "зі сторони червоної облямівки"
  //       : "";
  //   let perioList = changedList
  //     .filter((item) => item.status === "Pt")
  //     .map((item) => item.id);
  //   let sanationPerio = "";
  //   perioList.length === 1
  //     ? (sanationPerio = `Коронка ${perioList[0]} зуба зруйнована карієсом, перкусія його незначно болісна, патологічна рухомість 1-го ступеню. Наявна нориця на слизовій оболонці ясен з вестибулярної сторони в проекції верхівки коренів ${perioList[0]} зуба.`)
  //     : perioList.length > 1
  //     ? (sanationPerio = `Коронки ${perioList.join(
  //         ", "
  //       )} зубів зруйновані карієсом, перкусія їх незначно болісна, патологічна рухомість 1-го ступеню. Наявні нориці на слизовій оболонці ясен з вестибулярної сторони в проекції верхівки коренів ${perioList.join(
  //         ", "
  //       )} зубів.`)
  //     : (sanationPerio = ``);
  //   let perioTeethContent = "";
  //   perioTeeth.length === 2
  //     ? (perioTeethContent = `Коронка ${perioTeeth} зуба зруйнована карієсом, перкусія його незначно болісна, патологічна рухомість 1-го ступеню. Наявна нориця на слизовій оболонці ясен з вестибулярної сторони в проекції верхівки коренів ${perioTeeth} зуба.`)
  //     : perioTeeth.length > 2
  //     ? (perioTeethContent = `Коронки ${perioTeeth} зубів зруйновані карієсом, перкусія їх незначно болісна, патологічна рухомість 1-го ступеню. Наявні нориці на слизовій оболонці ясен з вестибулярної сторони в проекції верхівок коренів ${perioTeeth} зубів.`)
  //     : (perioTeethContent = "");
  
  //   let woundSize =
  //     woundDepth !== "" && woundWidth !== "" && woundLength !== ""
  //       ? ` розмірами приблизно ${woundLength}*${woundWidth}*${woundDepth} см`
  //       : "";
  //   if (type === "periostit") {
  //     switch (Number(tooth)) {
  //       case 54:
  //       case 55:
  //       case 14:
  //       case 15:
  //       case 16:
  //       case 17:
  //       case 18:
  //         return ` загальний стан дитини ${condition}. Обличчя  асиметричне за рахунок колатерального  набряку верхньої третини щічної ділянки та підочної ділянки праворуч. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці перехідної складки ${area} зубів, випукла, різко болісна при пальпації. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 64:
  //       case 65:
  //       case 24:
  //       case 25:
  //       case 26:
  //       case 27:
  //       case 28:
  //         return ` загальний стан дитини ${condition}. Обличчя  асиметричне за рахунок колатерального  набряку верхньої третини щічної ділянки та підочної ділянки ліворуч. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці перехідної складки ${area} зубів, випукла, різко болісна при пальпації. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 74:
  //       case 75:
  //       case 34:
  //       case 35:
  //       case 36:
  //       case 37:
  //       case 38:
  //         return `загальний стан дитини ${condition}. Обличчя  асиметричне за рахунок колатерального  набряку нижньої третини щічної ділянки ліворуч. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці перехідної складки ${area} зубів, випукла, різко болісна при пальпації. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 84:
  //       case 85:
  //       case 44:
  //       case 45:
  //       case 46:
  //       case 47:
  //       case 48:
  //         return `загальний стан дитини ${condition}. Обличчя  асиметричне за рахунок колатерального  набряку нижньої третини щічної ділянки праворуч. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці перехідної складки ${area} зубів, випукла, різко болісна при пальпації. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 51:
  //       case 52:
  //       case 53:
  //       case 11:
  //       case 12:
  //       case 13:
  //         return `загальний стан дитини ${condition} .Обличчя асиметричне за рахунок колатерального  набряку м'яких тканин верхньої губи праворуч. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці перехідної складки ${area} зубів, випукла, різко болісна при пальпації. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 61:
  //       case 62:
  //       case 63:
  //       case 21:
  //       case 22:
  //       case 23:
  //         return `загальний стан дитини ${condition}. Обличчя  асиметричне за рахунок колатерального  набряку м'яких тканин верхньої губи ліворуч. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці перехідної складки ${area} зубів, випукла, різко болісна при пальпації. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 71:
  //       case 72:
  //       case 73:
  //       case 31:
  //       case 32:
  //       case 33:
  //         return `загальний стан дитини ${condition}. Обличчя  асиметричне за рахунок колатерального  набряку м'яких тканин нижньої губи ліворуч. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці перехідної складки ${area} зубів, випукла, різко болісна при пальпації. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 81:
  //       case 82:
  //       case 83:
  //       case 41:
  //       case 42:
  //       case 43:
  //         return `загальний стан дитини ${condition}. Обличчя  асиметричне за рахунок колатерального  набряку м'яких тканин нижньої губи праворуч. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Слизова оболонка ротової порожнини в загальному блідо-рожева, проте гіперемійована та набрякла в ділянці перехідної складки ${area} зубів, випукла, різко болісна при пальпації. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       default:
  //         return `загальний стан дитини близький до задовільного. Обличчя  асиметричне. Шкіра над болючою припухлістю звичайного кольору, але починає набирати гіперемічного відтінку, в складку ще береться. Слизова оболонка ротової порожнини в загальному блідо-рожева, проте гіперемійована та набрякла в ділянці перехідної складки причинного зуба, випукла, різко болісна при пальпації. Коронка причинного зуба частково зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //     }
  //   } else if (type === "periodontit") {
  //     switch (Number(tooth)) {
  //       case 54:
  //       case 55:
  //       case 14:
  //       case 15:
  //       case 16:
  //       case 17:
  //       case 18:
  //         return `загальний стан дитини ${condition}. Обличчя  дещо асиметричне за рахунок невираженого колатерального набряку верхньої третини щічної та підочної ділянок праворуч. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 64:
  //       case 65:
  //       case 24:
  //       case 25:
  //       case 26:
  //       case 27:
  //       case 28:
  //         return `загальний стан дитини ${condition}. Обличчя  дещо асиметричне за рахунок невираженого колатерального набряку верхньої третини щічної та підочної ділянок ліворуч. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 74:
  //       case 75:
  //       case 34:
  //       case 35:
  //       case 36:
  //       case 37:
  //       case 38:
  //         return `загальний стан дитини ${condition}. Обличчя  дещо асиметричне за рахунок невираженого колатерального набряку нижньої третини щічної ділянки ліворуч. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна.`;
  //       case 84:
  //       case 85:
  //       case 44:
  //       case 45:
  //       case 46:
  //       case 47:
  //       case 48:
  //         return `загальний стан дитини ${condition}. Обличчя  дещо асиметричне за рахунок невираженого колатерального набряку нижньої третини щічної ділянки праворуч. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 51:
  //       case 52:
  //       case 53:
  //       case 11:
  //       case 12:
  //       case 13:
  //         return `загальний стан дитини ${condition}. Обличчя  дещо асиметричне за рахунок невираженого колатерального набряку верхньої губи праворуч. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 61:
  //       case 62:
  //       case 63:
  //       case 21:
  //       case 22:
  //       case 23:
  //         return `обличчя асиметричне за рахунок невираженого колатерального набряку верхньої губи ліворуч. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 71:
  //       case 72:
  //       case 73:
  //       case 31:
  //       case 32:
  //       case 33:
  //         return `загальний стан дитини ${condition}. Обличчя  дещо асиметричне за рахунок невираженого колатерального набряку нижньої губи ліворуч. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно.  Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       case 81:
  //       case 82:
  //       case 83:
  //       case 41:
  //       case 42:
  //       case 43:
  //         return `загальний стан дитини ${condition}. Обличчя  дещо асиметричне за рахунок невираженого колатерального набряку нижньої губи праворуч. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //       default:
  //         return `загальний стан дитини ${condition}. Обличчя симетричне. Шкіра над болючою припухлістю звичайного кольору, в складку береться вільно. Слизова оболонка ротової порожнини гіперемійована та набрякла в ділянці ${tooth} зуба. Коронка ${tooth} зуба ${crownDestruction} зруйнована карієсом, перкусія його різко болісна. ${perioTeethContent}`;
  //     }
  //   } else if (type === "skinWound") {
  //     return `загальний стан дитини ${condition}. Обличчя симетричне. При огляді ${woundArea}${woundSide} виявлена ${woundType} рана ${woundForm} форми,${woundSize} ${woundSurfaceStr}. ${woundLedges}. Кровоточивість з рани ${woundBleeding}. ${woundAliens}.`;
  //   } else if (type === "tongueBridle") {
  //     return `загальний стан дитини ${condition}. Обличчя симетричне. Язик звичайних розмірів, рухи його обмежені, дитина не може доторкнутися його кінчиком до піднебіння. Вуздечка язика коротка, представлена дублікатурою слизової оболонки.`;
  //   } else if (type === "lipBridle") {
  //     return `загальний стан дитини ${condition}. Наявна діастема між центральними різцями (11,21 зуби) верхньої щелепи. Ніжка вуздечки верхньої губи вплітається до сосочка між центральними різцями та переходить на серединний шов піднебіння. Коротка вуздечка верхньої губи зумовлює помітне втягування середньої частини червоної облямівки.`;
  //   } else if (type === "caries") {
  //     return `загальний стан дитини ${condition}. Обличчя симетричне. Шкірні покриви чисті. Слизова оболонка блідо-рожева. Зубна формула. ${sanationPerio}`;
  //   } else if (type === "abscess") {
  //     return `${abscessTemplate} ${abscessToothTemplate}`;
  //   } else if (type === "cyst") {
  //     return cystTemplate;
  //   } else if (type === "retention") {
  //     return `${generalCondition}Обличчя симетричне. ${retentionTemplate}`;
  //   } else if (type === "neoplasm") {
  //     return `${generalCondition}Обличчя симетричне. ${neoplasmTemplate}`;
  //   } else if (type === "fractureLowerJaw") {
  //     return `${generalCondition} ${fractureLowerJawTemplate}`;
  //   }
  // };
  